In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    'name': ['A', 'B', 'C', 'D'],
    'marks': [91, 80, 82, 88],
    'city': ['Patna', 'Lucknow', 'Kanpur', 'Ranchi']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

  name  marks     city
0    A     91    Patna
1    B     80  Lucknow
2    C     82   Kanpur
3    D     88   Ranchi

In [5]:
df.to_csv('../data/sample.csv')

In [6]:
df.to_csv('../data/sample_index_false.csv', index = False)

In [7]:
df.describe()

           marks
count   4.000000
mean   85.250000
std     5.123475
min    80.000000
25%    81.500000
50%    85.000000
75%    88.750000
max    91.000000

In [8]:
print(df.values)

[['A' 91 'Patna']
 ['B' 80 'Lucknow']
 ['C' 82 'Kanpur']
 ['D' 88 'Ranchi']]

In [10]:
type(pd.Series(np.random.rand(334)))

pandas.core.series.Series

In [16]:
newDf = pd.DataFrame(np.random.rand(300, 5))

In [17]:
newDf

            0         1         2         3         4
0    0.398411  0.977278  0.101693  0.736245  0.671900
1    0.905124  0.822610  0.125654  0.896056  0.825346
2    0.973992  0.948025  0.394041  0.233391  0.112078
3    0.982307  0.451967  0.197520  0.372739  0.482113
4    0.313504  0.824741  0.449164  0.485672  0.360895
..        ...       ...       ...       ...       ...
295  0.852805  0.625112  0.794064  0.563318  0.062231
296  0.697809  0.975995  0.291412  0.993697  0.117698
297  0.420169  0.781884  0.926229  0.889806  0.644638
298  0.616362  0.537877  0.295183  0.534217  0.740966
299  0.876060  0.583977  0.989881  0.541856  0.506447

[300 rows x 5 columns]

In [18]:
df.columns

Index(['name', 'marks', 'city'], dtype='object')

In [19]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [20]:
newDf[0][0] = 'hello'

In [21]:
newDf

            0         1         2         3         4
0       hello  0.977278  0.101693  0.736245  0.671900
1    0.905124  0.822610  0.125654  0.896056  0.825346
2    0.973992  0.948025  0.394041  0.233391  0.112078
3    0.982307  0.451967  0.197520  0.372739  0.482113
4    0.313504  0.824741  0.449164  0.485672  0.360895
..        ...       ...       ...       ...       ...
295  0.852805  0.625112  0.794064  0.563318  0.062231
296  0.697809  0.975995  0.291412  0.993697  0.117698
297  0.420169  0.781884  0.926229  0.889806  0.644638
298  0.616362  0.537877  0.295183  0.534217  0.740966
299   0.87606  0.583977  0.989881  0.541856  0.506447

[300 rows x 5 columns]

In [26]:
newDf.to_numpy()

array([[1.4, 0.9772776251276335, 0.10169279395602215, 0.736244888986524,
        0.6718998452723983],
       [0.9051243286978343, 0.822609593844642, 0.12565377016737844,
        0.8960563397065668, 0.8253460613930339],
       [0.9739919135242723, 0.9480250149571859, 0.39404105801522893,
        0.2333914557170872, 0.11207810269533491],
       ...,
       [0.420168917043122, 0.7818835086423345, 0.9262293238557304,
        0.889806328484249, 0.6446380242276072],
       [0.616362307157511, 0.5378774250425828, 0.2951828663536329,
        0.5342171922485576, 0.7409655529014874],
       [0.8760601727398574, 0.5839767081966187, 0.9898811763594878,
        0.5418562453084309, 0.5064472050639499]], dtype=object)

In [25]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [24]:
newDf[0][0] = 1.4

In [32]:
newDf.sort_index(axis = 1, ascending = False)

            4         3         2         1         0
0    0.671900  0.736245  0.101693  0.977278       1.4
1    0.825346  0.896056  0.125654  0.822610  0.905124
2    0.112078  0.233391  0.394041  0.948025  0.973992
3    0.482113  0.372739  0.197520  0.451967  0.982307
4    0.360895  0.485672  0.449164  0.824741  0.313504
..        ...       ...       ...       ...       ...
295  0.062231  0.563318  0.794064  0.625112  0.852805
296  0.117698  0.993697  0.291412  0.975995  0.697809
297  0.644638  0.889806  0.926229  0.781884  0.420169
298  0.740966  0.534217  0.295183  0.537877  0.616362
299  0.506447  0.541856  0.989881  0.583977   0.87606

[300 rows x 5 columns]

In [37]:
newDf.sort_values(by=[1], axis=1, ascending=False)

            0         3         4         1         2
0         1.4  0.736245  0.671900  0.977278  0.101693
1    0.905124  0.896056  0.825346  0.822610  0.125654
2    0.973992  0.233391  0.112078  0.948025  0.394041
3    0.982307  0.372739  0.482113  0.451967  0.197520
4    0.313504  0.485672  0.360895  0.824741  0.449164
..        ...       ...       ...       ...       ...
295  0.852805  0.563318  0.062231  0.625112  0.794064
296  0.697809  0.993697  0.117698  0.975995  0.291412
297  0.420169  0.889806  0.644638  0.781884  0.926229
298  0.616362  0.534217  0.740966  0.537877  0.295183
299   0.87606  0.541856  0.506447  0.583977  0.989881

[300 rows x 5 columns]

In [38]:
df.to_numpy()

array([['A', 91, 'Patna'],
       ['B', 80, 'Lucknow'],
       ['C', 82, 'Kanpur'],
       ['D', 88, 'Ranchi']], dtype=object)

In [39]:
df.to_numpy()[0]

array(['A', 91, 'Patna'], dtype=object)

In [40]:
print(df.to_numpy())

[['A' 91 'Patna']
 ['B' 80 'Lucknow']
 ['C' 82 'Kanpur']
 ['D' 88 'Ranchi']]